/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_print_comb.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: yufli <yufli@student.42barcelona.com>      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/11/17 07:25:19 by yufli             #+#    #+#             */
/*   Updated: 2025/11/17 08:59:03 by yufli            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* 固定任务 — 
 * 输出所有 3 个不同数字且升序的组合（000~999 不允许重复同位数字且按升序排列）
 * 最简单用三重循环或三层索引即可 */

#include <unistd.h>

void	ft_print_comb(void)
{
	int	x;
	int	y;
	int	z;

	x = 0;
	while (x <= 7)
	{
		y = x + 1;
		while (y <= 8)
		{
			z = y + 1;
			while (z <= 9)
			{
				write(1, &x, 1);
				write(1, &y, 1);
				write(1, &z, 1);
				if (x != 7 && y != 8 && c3 != 9)
					write(1, ", ", 2);
				z++;
			}
			y++;
		}
		x++;
	}
}
